ERP DEV.КонтурМаркировка/src/Catalogs/КонтурМаркировка_КлючиНоменклатуры1С/КонтурМаркировка_КлючиНоменклатуры1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурМаркировка_КлючиНоменклатуры1С</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючНоменклатуры</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючХарактеристики</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючУпаковки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючСерии</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлючаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлючаХарактеристики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлючаУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлючаСерии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.КонтурМаркировка/src/Catalogs/КонтурМаркировка_КлючиНоменклатуры1С/ManagerModule.bsl
// #Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("КлючНоменклатуры");
	Поля.Добавить("КлючХарактеристики");
	Поля.Добавить("КлючУпаковки");
	Поля.Добавить("КлючСерии");
	
	Поля.Добавить("ТипКлючаНоменклатуры");
	Поля.Добавить("ТипКлючаХарактеристики");
	Поля.Добавить("ТипКлючаУпаковки");
	Поля.Добавить("ТипКлючаСерии");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = ПредставлениеНоменклатуры1С(Данные);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру с объектами 1С по ключу номенклатуры 1С или его аналитике
//
// Параметры:
//  КлючНоменклатуры1С - СправочникСсылка.КонтурМаркировка_КлючиНоменклатуры1С, Структура - содержит поля:
//   * КлючНоменклатуры - УникальныйИдентификатор - ключ номенклатуры;
//   * КлючХарактеристики - УникальныйИдентификатор - ключ характеристики;
//   * КлючУпаковки - УникальныйИдентификатор - ключ упаковки;
//   * КлючСерии - УникальныйИдентификатор - ключ серии;
//   * ТипКлючаНоменклатуры - Строка - полное имя справочника номенклатуры;
//   * ТипКлючаХарактеристики - Строка - полное имя справочника характеристики;
//   * ТипКлючаУпаковки - Строка - полное имя справочника упаковки;
//   * ТипКлючаСерии - Строка - полное имя справочника серии;
//  КэшРезультатов - Соответствие - кэш результатов функции;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * Номенклатура - СправочникСсылка - номенклатура;
//   * Характеристика - СправочникСсылка - характеристика;
//   * Упаковка - СправочникСсылка - упаковка;
//   * Серия - СправочникСсылка - серия;
//
Функция АналитикаНоменклатуры1С(КлючНоменклатуры1С, КэшРезультатов = Неопределено) Экспорт
	
	Результат = Новый Структура(ИменаПолейАналитикиНоменклатуры1С());
	
	Если КлючНоменклатуры1С = Неопределено
		Или Не ЗначениеЗаполнено(КлючНоменклатуры1С.КлючНоменклатуры) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если КэшРезультатов <> Неопределено Тогда
		
		Если ТипЗнч(КлючНоменклатуры1С) = Тип("СправочникСсылка.КонтурМаркировка_КлючиНоменклатуры1С") Тогда
			КлючКэш = КлючНоменклатуры1С;
		Иначе
			КлючКэш = СтрокаАналитикиКлючаНоменклатуры1С(КлючНоменклатуры1С);
		КонецЕсли;
		
		РезультатИзКэш = КэшРезультатов[КлючКэш];
		Если РезультатИзКэш <> Неопределено Тогда
			Возврат РезультатИзКэш;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючНоменклатуры1С.КлючНоменклатуры) Тогда
		Результат.Номенклатура = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(
		КлючНоменклатуры1С.КлючНоменклатуры, КлючНоменклатуры1С.ТипКлючаНоменклатуры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючНоменклатуры1С.КлючХарактеристики) Тогда
		Результат.Характеристика = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(
		КлючНоменклатуры1С.КлючХарактеристики, КлючНоменклатуры1С.ТипКлючаХарактеристики);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючНоменклатуры1С.КлючУпаковки) Тогда
		Результат.Упаковка = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(
		КлючНоменклатуры1С.КлючУпаковки, КлючНоменклатуры1С.ТипКлючаУпаковки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючНоменклатуры1С.КлючСерии) Тогда
		Результат.Серия = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(
		КлючНоменклатуры1С.КлючСерии, КлючНоменклатуры1С.ТипКлючаСерии);
	КонецЕсли;
	
	Если КэшРезультатов <> Неопределено Тогда
		КэшРезультатов.Вставить(КлючКэш, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует рабочее представление номенклатуры 1С
//
// Параметры:
//  КлючНоменклатуры1С - СправочникСсылка.КонтурМаркировка_КлючиНоменклатуры1С, Структура - содержит поля:
//   * КлючНоменклатуры - УникальныйИдентификатор - ключ номенклатуры;
//   * КлючХарактеристики - УникальныйИдентификатор - ключ характеристики;
//   * КлючУпаковки - УникальныйИдентификатор - ключ упаковки;
//   * КлючСерии - УникальныйИдентификатор - ключ серии;
//   * ТипКлючаНоменклатуры - Строка - полное имя справочника номенклатуры;
//   * ТипКлючаХарактеристики - Строка - полное имя справочника характеристики;
//   * ТипКлючаУпаковки - Строка - полное имя справочника упаковки;
//   * ТипКлючаСерии - Строка - полное имя справочника серии;
// 
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеНоменклатуры1С(КлючНоменклатуры1С) Экспорт
	
	АналитикаНоменклатуры = АналитикаНоменклатуры1С(КлючНоменклатуры1С);
	
	Результат = СокрЛП(АналитикаНоменклатуры.Номенклатура);
	
	ТекстВСкобках = ПредставлениеНоменклатуры1С_ТекстВСкобках(АналитикаНоменклатуры);
	Если ЗначениеЗаполнено(ТекстВСкобках) Тогда
		Результат = Результат + " (" + ТекстВСкобках + ")";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает строку с именами полей аналитики номенклатуры 1С
// 
// Возвращаемое значение:
//  Строка - имена полей разделенные запятыми
//
Функция ИменаПолейАналитикиНоменклатуры1С() Экспорт
	
	Возврат "Номенклатура, Характеристика, Упаковка, Серия";
	
КонецФункции

// Возвращает строку с именами ключей аналитики номенклатуры 1С
// 
// Возвращаемое значение:
//  Строка - имена ключей разделенные запятыми
//
Функция ИменаКлючейАналитикиНоменклатуры1С() Экспорт
	
	Возврат "КлючНоменклатуры, КлючХарактеристики, КлючУпаковки, КлючСерии";
	
КонецФункции

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

Функция ПредставлениеНоменклатуры1С_ТекстВСкобках(АналитикаНоменклатуры)
	
	Результат = "";
	Разделитель = "";
	
	Если ЗначениеЗаполнено(АналитикаНоменклатуры.Характеристика) Тогда
		Результат = Результат + Разделитель + СокрЛП(АналитикаНоменклатуры.Характеристика);
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АналитикаНоменклатуры.Упаковка) Тогда
		Результат = Результат + Разделитель + СокрЛП(АналитикаНоменклатуры.Упаковка);
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АналитикаНоменклатуры.Серия) Тогда
		Результат = Результат + Разделитель + СокрЛП(АналитикаНоменклатуры.Серия);
		Разделитель = ", ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаАналитикиКлючаНоменклатуры1С(АналитикаКлюча)
	
	СтрокаКлючНоменклатуры = "";
	Если ЗначениеЗаполнено(АналитикаКлюча.КлючНоменклатуры) Тогда
		СтрокаКлючНоменклатуры = Строка(АналитикаКлюча.КлючНоменклатуры) + "." + АналитикаКлюча.ТипКлючаНоменклатуры;
	КонецЕсли;
	
	СтрокаКлючХарактеристики = "";
	Если ЗначениеЗаполнено(АналитикаКлюча.КлючХарактеристики) Тогда
		СтрокаКлючХарактеристики = Строка(АналитикаКлюча.КлючХарактеристики) + "." + АналитикаКлюча.ТипКлючаХарактеристики;
	КонецЕсли;
	
	СтрокаКлючУпаковки = "";
	Если ЗначениеЗаполнено(АналитикаКлюча.КлючУпаковки) Тогда
		СтрокаКлючУпаковки = Строка(АналитикаКлюча.КлючУпаковки) + "." + АналитикаКлюча.ТипКлючаУпаковки;
	КонецЕсли;
	
	СтрокаКлючСерии = "";
	Если ЗначениеЗаполнено(АналитикаКлюча.КлючСерии) Тогда
		СтрокаКлючСерии = Строка(АналитикаКлюча.КлючСерии) + "." + АналитикаКлюча.ТипКлючаСерии;
	КонецЕсли;
	
	Возврат СтрокаКлючНоменклатуры + ", " + СтрокаКлючХарактеристики + ", " + СтрокаКлючУпаковки + ", " + СтрокаКлючСерии;
	
КонецФункции

// #КонецОбласти
